/*
 Navicat Premium Data Transfer

 Source Server         : root
 Source Server Type    : MySQL
 Source Server Version : 80022
 Source Host           : localhost:3306
 Source Schema         : vueblog

 Target Server Type    : MySQL
 Target Server Version : 80022
 File Encoding         : 65001

 Date: 11/09/2021 11:35:10
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for m_blog
-- ----------------------------
DROP TABLE IF EXISTS `m_blog`;
CREATE TABLE `m_blog`  (
  `id` bigint(0) NOT NULL,
  `user_id` bigint(0) NOT NULL COMMENT '用户id',
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章标题',
  `description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章描述',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '文章内容',
  `created` datetime(0) NOT NULL COMMENT '创建时间',
  `status` int(0) NOT NULL DEFAULT 0 COMMENT '状态(-1)禁用(0)正常',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of m_blog
-- ----------------------------
INSERT INTO `m_blog` VALUES (73422, 1, '\r\n多国政府及学者发声 反对新冠病毒溯源问题政治化', '近日美国情报部门炮制所谓新冠病毒溯源问题调查报告。多国政府及专家学者相继发表声明，反对将新冠病毒溯源问题政治化。', '当地时间9月8日，斯里兰卡外交部发表《关于新冠病毒溯源问题的声明》，反对将病毒溯源政治化，要求尊重世界卫生组织联合研究报道的权威性。\r\n\r\n斯里兰卡外交部在声明中表示，新冠肺炎大流行严重影响了世界各国人民的健康、安全和生计，多边主义和国际合作是有效、持续战胜疫情的最佳出路。对病毒的起源进行全面、包容、客观的研究亦同等重要。\r\n\r\n斯里兰卡注意到，世卫组织在这方面发挥着领导作用，也注意到了世卫组织今年3月发布的联合研究报告的相关内容。斯里兰卡重申，新冠病毒溯源研究应符合科学、基于事实，而不应被政治化。下阶段的研究应反映此前世卫组织牵头研究已得出的关键结论。\r\n\r\n斯里兰卡将继续与国际社会开展建设性合作，就新冠病毒有关问题寻找公允、全面的解决办法。\r\n\r\n近日，玻利维亚副外长马马尼通过社交媒体表示，新冠病毒溯源是事关全人类的重大问题，也是事关全球抗击疫情的根本性问题，因此必须诉诸于科学。玻利维亚谴责任何以疫情为工具、将相关问题政治化的企图。\r\n\r\n此外，乌干达智库发展观察中心创始人、知名学者塞曼达近日在乌第一大报《新愿景报》和该智库网络平台上同步发表题为《新冠病毒溯源是科学问题而非政治问题》的署名文章，深刻揭批美国将病毒溯源政治化。', '2021-09-29 20:11:51', 0);
INSERT INTO `m_blog` VALUES (984523, 1, '\r\n如何充分挖掘国内市场潜力', '中国有14亿多人口，中等收入群体超过4亿，是全球最具潜力的大市场', '超大规模的市场优势，已成为我国经济发展新的比较优势。从内生增长动力来看，2021年上半年我国国内需求对经济增长的贡献率为80.9%，固定资产投资、社会消费品零售总额同比分别增长12.6%、23%，两年平均增速均为4.4%，表现出我国内需市场的强大韧性，为我国经济社会持续稳定健康发展提供了充足动力、强劲支撑和回旋余地。\r\n　　\r\n　　然而，在看到经济持续稳定恢复、稳中向好发展的同时，也要注意到当前全球疫情仍在持续演变，国际环境日趋复杂严峻，国内经济恢复仍具有一定的不确定性。与供给侧的快速复苏相比，需求侧的恢复一直相对滞后，且不同消费领域之间存在明显分化。在经济发展过程中，供给侧和需求侧的关系就好比自行车的前后轮，需要通过后轮来推动需求、创造需求，用前轮来引导供给、把握供给，在互相促进中达到供需两端新的更高水平的动态平衡，最终实现经济社会高质量发展。为此，我们要充分挖掘国内市场潜力，坚持扩大内需这个战略基点，进一步增强消费对经济发展的基础性作用，将超大规模的市场优势和内需潜力转化为经济发展的实力和动力。', '2021-09-22 20:10:45', 0);
INSERT INTO `m_blog` VALUES (2134213, 1, '习近平金句妙喻“金砖”', '应印度总理莫迪邀请\r\n\r\n国家主席习近平\r\n\r\n将于9月9日在北京', '志合者\r\n\r\n不以山海为远\r\n\r\n从首次金砖国家外长会议至今\r\n\r\n金砖国家合作已经走过十多个年头\r\n\r\n\r\n\r\n多年来\r\n\r\n为促进金砖国家合作发展\r\n\r\n习近平提出了一系列\r\n\r\n充满智慧的重要思想', '2021-08-13 18:22:56', 0);
INSERT INTO `m_blog` VALUES (8098089, 1, '中国残疾人体育事业取得长足进步 彰显我国制度优势', '央视网消息（新闻联播）：在东京残奥会的赛场上，中国残奥运动员们顽强拼搏，取得了优异成绩，这也是我国残疾人体育事业取得长足进步、中国人权事业发展开辟新境界的生动写照。', '在东京残奥会田径赛场，这位在赛后被领跑员高高托起的盲人运动员叫刘翠青。从2013年起，她和领跑员徐冬林成为搭档，靠着一条10厘米的牵引绳并肩作战，8年的坚持与付出，在东京他们一起携手，成功卫冕。\r\n\r\n　　如今，像刘翠青和徐冬林这样体育场内的携手也延伸到场外全民健身的队伍中。在浙江省湖州市奥体中心附近，每个周末这里都会出现一群身着橙色运动上衣的跑者，他们的后背上分别写着“视障”和“陪跑”的字样。这是2018年当地盲人协会和公益人士一起发起的陪跑项目，如今已经从刚开始五六个人发展到现在80多人固定参加例跑。', '2021-08-13 18:22:56', 0);
INSERT INTO `m_blog` VALUES (745672546, 1, '教育部最新通知：坚决查处', '近日，教育部办公厅发布《关于坚决查处变相违规开展学科类校外培训问题的通知》。', '各省、自治区、直辖市教育厅（教委），新疆生产建设兵团教育局：《中共中央办公厅 国务院办公厅关于进一步减轻义务教育阶段学生作业负担和校外培训负担的意见》印发以来，各地大力推进校外培训治理，取得初步成效。但一些地方出现了学科类培训转入“地下”，换个“马甲”逃避监管等隐形变异问题，影响政策实施，造成不良影响。为指导各地坚决查处学科类校外培训隐形变异问题，现就有关工作通知如下。一、明确合规要求。开展学科类校外培训须在培训主体、培训人员、培训时间、培训地点、培训内容、培训方式等方面同时符合国家相关规定。合规性学科类校外培训一般是指证照齐全的校外培训机构，在登记的培训场所和规定的培训时间，由其所聘请的具有教师资格的培训人员，按照规定的培训方式，面向中小学生提供的符合培训内容要求的学科类培训服务。二、把准变异形态。对不符合上述合规性要求，具有下列情形之一的学科类培训行为，应依法依规予以查处：1、违反培训主体有关规定，证照不全的机构或个人，以咨询、文化传播、“家政服务”“住家教师”“众筹私教”等名义违规开展学科类培训。2、违反培训人员有关规定，不具备教师资格的人员违规开展学科类培训，在职中小学教师违规开展有偿补课。3、违反培训时间有关规定，通过“直播变录播”等方式违规开展学科类培训。4、违反培训地点有关规定，组织异地培训，在居民楼、酒店、咖啡厅等场所，化整为零在登记场所之外开展“一对一”“一对多”等学科类培训。5、违反培训内容有关规定，以游学、研学、夏令营、思维素养、国学素养等名义，或者在科技、体育、文化艺术等非学科类培训中，违规开展学科类培训。6、违反培训方式有关规定，线下机构通过即时通讯、网络会议、直播平台等方式违规开展线上学科类培训。7、其他违反相关规定的隐形变异学科类培训。三、建立辨别机制。对于明显违反相关规定的，各级教育行政部门要旗帜鲜明严肃查处。根据学科类校外培训隐形变异行为的隐蔽性、多变性特点，以及实践中出现的新情况、新问题，地方教育行政部门可以成立专家委员会或指定专业机构，对隐形变异培训行为进行科学辨别。四、落实属地管理。各地要按照“谁审批、谁负责”的原则，对学科类培训的隐形变异问题进行查处。对于证照不全的机构和个人，根据国务院《无证无照经营查处办法》的规定予以查处。对跨区域违规行为，由培训机构审批地、违规行为发生地相关部门共同查处。五、强化监管执法。各地要充分发挥“双减”工作专门协调机制作用，强化部门协同、条块联动，压实责任。要将学科类培训隐形变异问题查处工作纳入省、市、县和乡镇（街道）网格化综合治理体系，充分发挥社区综合治理功能，开展区域巡查执法。要畅通投诉举报渠道，拓展问题线索来源，强化社会监督。对隐形变异违规培训行为，要加大执法力度，发现一起、查处一起、通报一起。要创新监管方式，推进“互联网+监管”，会同相关部门，探索将违规培训的机构和个人信息，纳入全国信用信息共享平台，实施联合惩戒，坚决防止隐形变异违规培训行为蔓延。教育部办公厅2021年9月3日', '2021-08-13 18:22:56', 0);

-- ----------------------------
-- Table structure for m_user
-- ----------------------------
DROP TABLE IF EXISTS `m_user`;
CREATE TABLE `m_user`  (
  `id` bigint(0) NOT NULL,
  `username` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '用户名',
  `avatar` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '头像',
  `email` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL COMMENT '邮箱',
  `password` varchar(64) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '密码',
  `status` int(0) NOT NULL COMMENT '状态',
  `created` datetime(0) NULL DEFAULT NULL COMMENT '创建时间',
  `last_login` datetime(0) NULL DEFAULT NULL COMMENT '最后登录时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of m_user
-- ----------------------------
INSERT INTO `m_user` VALUES (1, 'xiaohaha', NULL, NULL, '123456', 1, '2021-08-13 18:22:56', '2021-08-13 18:22:56');

SET FOREIGN_KEY_CHECKS = 1;
